benchmarks/n_0510_b.txt
/usr/bin/java  -classpath /mnt/sdb/YCSB/conf:/mnt/sdb/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/mnt/sdb/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.4.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/animal-sniffer-annotations-1.19.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/annotations-4.1.1.4.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/checker-compat-qual-2.5.5.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/error_prone_annotations-2.4.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/failureaccess-1.0.1.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-api-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-context-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-core-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-netty-shaded-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-protobuf-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-protobuf-lite-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-stub-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/gson-2.8.6.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/guava-30.0-android.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/j2objc-annotations-1.3.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/javax.annotation-api-1.3.2.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/jsr305-3.0.2.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/listenablefuture-9999.0-empty-to-avoid-conflict-with-guava.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/perfmark-api-0.23.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/proto-google-common-protos-2.0.1.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/protobuf-java-3.12.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -load -db site.ycsb.db.rocksdb.RocksDBClient -s -P workloads/workloadb -p rocksdb.dir=/users/root/test -threads 16 -replicator_addr 128.110.153.185:50050 -replicator_batch_size 10
Set replicator_addr to 128.110.153.185:50050
Set replicator batch size to 10
communicating with replicator at 128.110.153.185:50050
recvCount: 187500 met target
returned from latch for thread 56
recvCount: 187500 met target
returned from latch for thread 60
recvCount: 187500 met target
returned from latch for thread 66
recvCount: 187500 met target
returned from latch for thread 27
recvCount: 187500 met target
returned from latch for thread 54
recvCount: 187500 met target
returned from latch for thread 50
recvCount: 187500 met target
returned from latch for thread 65
recvCount: 187500 met target
returned from latch for thread 58
recvCount: 187500 met target
returned from latch for thread 33
recvCount: 187500 met target
returned from latch for thread 46
recvCount: 187500 met target
returned from latch for thread 59
recvCount: 187500 met target
returned from latch for thread 42
recvCount: 187500 met target
returned from latch for thread 38
recvCount: 187500 met target
returned from latch for thread 30
recvCount: 187500 met target
returned from latch for thread 57
recvCount: 187500 met target
returned from latch for thread 23
[OVERALL], RunTime(ms), 72122
[OVERALL], Throughput(ops/sec), 41596.18424336541
[TOTAL_GCS_G1_Young_Generation], Count, 26
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1036
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.4364548958708856
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 26
[TOTAL_GC_TIME], Time(ms), 1036
[TOTAL_GC_TIME_%], Time(%), 1.4364548958708856
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 259.5
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 4071
[CLEANUP], 95thPercentileLatency(us), 12
[CLEANUP], 99thPercentileLatency(us), 4071
[INSERT], Operations, 3000000
[INSERT], AverageLatency(us), 348.479555
[INSERT], MinLatency(us), 2
[INSERT], MaxLatency(us), 63176703
[INSERT], 95thPercentileLatency(us), 32
[INSERT], 99thPercentileLatency(us), 68
[INSERT], Return=OK, 3000000
/usr/bin/java  -classpath /mnt/sdb/YCSB/conf:/mnt/sdb/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/mnt/sdb/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.4.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/animal-sniffer-annotations-1.19.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/annotations-4.1.1.4.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/checker-compat-qual-2.5.5.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/error_prone_annotations-2.4.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/failureaccess-1.0.1.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-api-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-context-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-core-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-netty-shaded-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-protobuf-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-protobuf-lite-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-stub-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/gson-2.8.6.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/guava-30.0-android.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/j2objc-annotations-1.3.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/javax.annotation-api-1.3.2.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/jsr305-3.0.2.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/listenablefuture-9999.0-empty-to-avoid-conflict-with-guava.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/perfmark-api-0.23.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/proto-google-common-protos-2.0.1.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/protobuf-java-3.12.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -t -db site.ycsb.db.rocksdb.RocksDBClient -s -P workloads/workloadb -p rocksdb.dir=/users/root/test -threads 16 -replicator_addr 128.110.153.185:50050 -replicator_batch_size 10
Set replicator_addr to 128.110.153.185:50050
Set replicator batch size to 10
communicating with replicator at 128.110.153.185:50050
recvCount: 62500 met target
returned from latch for thread 69
recvCount: 62500 met target
returned from latch for thread 49
recvCount: 62500 met target
returned from latch for thread 59
recvCount: 62500 met target
returned from latch for thread 27
recvCount: 62500 met target
returned from latch for thread 68
recvCount: 62500 met target
returned from latch for thread 54
recvCount: 62500 met target
returned from latch for thread 70
recvCount: 62500 met target
returned from latch for thread 33
recvCount: 62500 met target
returned from latch for thread 58
recvCount: 62500 met target
returned from latch for thread 56
recvCount: 62500 met target
returned from latch for thread 57
recvCount: 62500 met target
returned from latch for thread 30
recvCount: 62500 met target
returned from latch for thread 23
recvCount: 62500 met target
returned from latch for thread 38
recvCount: 62500 met target
returned from latch for thread 46
recvCount: 62500 met target
returned from latch for thread 42
[OVERALL], RunTime(ms), 8350
[OVERALL], Throughput(ops/sec), 119760.47904191617
[TOTAL_GCS_G1_Young_Generation], Count, 14
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 341
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 4.083832335329341
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 14
[TOTAL_GC_TIME], Time(ms), 341
[TOTAL_GC_TIME_%], Time(%), 4.083832335329341
[READ], Operations, 950041
[READ], AverageLatency(us), 92.15730373741765
[READ], MinLatency(us), 0
[READ], MaxLatency(us), 6750207
[READ], 95thPercentileLatency(us), 3
[READ], 99thPercentileLatency(us), 7
[READ], Return=OK, 950041
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 273.875
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 4263
[CLEANUP], 95thPercentileLatency(us), 27
[CLEANUP], 99thPercentileLatency(us), 4263
[UPDATE], Operations, 49959
[UPDATE], AverageLatency(us), 120.95642426789968
[UPDATE], MinLatency(us), 0
[UPDATE], MaxLatency(us), 4689919
[UPDATE], 95thPercentileLatency(us), 14
[UPDATE], 99thPercentileLatency(us), 57
[UPDATE], Return=OK, 49959